Documents/Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Заказы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Расход</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗаказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦенаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦенаТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Заказы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция КлиентПриИзмененииНаСервере(Ссылка)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка,
	               |	Клиенты.Адрес КАК Адрес,
	               |	Клиенты.Телефон КАК Телефон,
	               |	Клиенты.ДополнительныйАдрес КАК ДополнительныйАдрес
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Клиент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Альфа = Новый Массив(2);
	Альфа[0] = РезультатЗапроса.Получить(0).Адрес;
	Альфа[1] = РезультатЗапроса.Получить(0).Телефон;
	
	Возврат Альфа 
	
КонецФункции

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Бета = КлиентПриИзмененииНаСервере(Объект.Клиент);
	Объект.Адрес = Бета[0];
	Объект.Телефон = Бета[1];
КонецПроцедуры

&НаСервере
Функция ТаблицаЗаказТоварПриИзмененииНаСервере(Номенклатура)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦенаТоваров.Номенклатура КАК Номенклатура,
	|	ЦенаТоваров.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦенаТоваров КАК ЦенаТоваров
	|ГДЕ
	|	ЦенаТоваров.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Омега = РезультатЗапроса.Получить(0).Цена; 
	
	Возврат Омега 
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаказТоварПриИзменении(Элемент)
	Стр = Элементы.ТаблицаЗаказ.ТекущиеДанные;
	Дельта = ТаблицаЗаказТоварПриИзмененииНаСервере(Стр.Номенклатура);
	Стр.Цена = Дельта;
	
	Стр = Элементы.ТаблицаЗаказ.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаказКоличествоПриИзменении(Элемент)
	Стр = Элементы.ТаблицаЗаказ.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
КонецПроцедуры
